---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.Parameter
zh: 参数、共享参数
source: html/5ca02b0e-289a-f1ef-7ce2-8b3f175fe402.htm
---
# Autodesk.Revit.DB.IntersectionResult.Parameter Property

**中文**: 参数、共享参数

1d parameter of the point of intersection.

## Syntax (C#)
```csharp
public double Parameter { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.